---
type: PostPattern
namespace: Autodesk.Revit.DB.Architecture
version: 2024
members: 7
tags: [revit-api, class]
---

# PostPattern

`Autodesk.Revit.DB.Architecture.PostPattern` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Property | CornerPost | 2019 | `public BalusterInfo CornerPost { get ; }` |
| Property | CornerPostAngle | 2019 | `public double CornerPostAngle { get ; set ; }` |
| Property | CornerPostCondition | 2019 | `public BreakCornerCondition CornerPostCondition { get ; set ; }` |
| Property | EndPost | 2019 | `public BalusterInfo EndPost { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | StartPost | 2019 | `public BalusterInfo StartPost { get ; }` |